yamamo2shun1/C4NDY/STM32CubeIDE/C4NDY_composite_HID_UAC/Core/Inc/ADAU1761_IC_1_REG.h
/* Record Volume Ctrl Left (IC 1) */
#define R9_REC_VOL_CTRL_LFT_DIFPATH_IC_1          0x0    /* 0b	[0] */
#define R9_REC_VOL_CTRL_LFT_MUTE_IC_1             0x0    /* 0b	[1] */
#define R9_REC_VOL_CTRL_LFT_IC_1                  0x0    /* 000000b	[7:2] */
#define R9_REC_VOL_CTRL_LFT_DIFPATH_IC_1_MASK     0x1
#define R9_REC_VOL_CTRL_LFT_DIFPATH_IC_1_SHIFT    0
#define R9_REC_VOL_CTRL_LFT_MUTE_IC_1_MASK        0x2
#define R9_REC_VOL_CTRL_LFT_MUTE_IC_1_SHIFT       1
#define R9_REC_VOL_CTRL_LFT_IC_1_MASK             0xFC
#define R9_REC_VOL_CTRL_LFT_IC_1_SHIFT            2

/* Record Volume Ctrl Right (IC 1) */
#define R10_REC_VOL_CTRL_RGT_DIFPATH_IC_1         0x0    /* 0b	[0] */
#define R10_REC_VOL_CTRL_RGT_MUTE_IC_1            0x0    /* 0b	[1] */
#define R10_REC_VOL_CTRL_RGT_IC_1                 0x0    /* 000000b	[7:2] */
#define R10_REC_VOL_CTRL_RGT_DIFPATH_IC_1_MASK    0x1
#define R10_REC_VOL_CTRL_RGT_DIFPATH_IC_1_SHIFT   0
#define R10_REC_VOL_CTRL_RGT_MUTE_IC_1_MASK       0x2
#define R10_REC_VOL_CTRL_RGT_MUTE_IC_1_SHIFT      1
#define R10_REC_VOL_CTRL_RGT_IC_1_MASK            0xFC
#define R10_REC_VOL_CTRL_RGT_IC_1_SHIFT           2

/* Record Mic Bias Control (IC 1) */
#define R11_MIC_ENABLE_IC_1                       0x0    /* 0b	[0] */
#define R11_MIC_GAIN_IC_1                         0x0    /* 0b	[2] */
#define R11_MIC_HI_PERFORM_IC_1                   0x0    /* 0b	[3] */
#define R11_MIC_ENABLE_IC_1_MASK                  0x1
#define R11_MIC_ENABLE_IC_1_SHIFT                 0
#define R11_MIC_GAIN_IC_1_MASK                    0x4
#define R11_MIC_GAIN_IC_1_SHIFT                   2
#define R11_MIC_HI_PERFORM_IC_1_MASK              0x8
#define R11_MIC_HI_PERFORM_IC_1_SHIFT             3

/* ALC Control 0 (IC 1) */
#define R12_ALC_SELECT_IC_1                       0x0    /* 000b	[2:0] */
#define R12_MAX_ALC_VOLUME_GAIN_IC_1              0x0    /* 000b	[5:3] */
#define R12_ALC_VOLUME_SLEW_TIME_IC_1             0x0    /* 00b	[7:6] */
#define R12_ALC_SELECT_IC_1_MASK                  0x7
#define R12_ALC_SELECT_IC_1_SHIFT                 0
#define R12_MAX_ALC_VOLUME_GAIN_IC_1_MASK         0x38
#define R12_MAX_ALC_VOLUME_GAIN_IC_1_SHIFT        3
#define R12_ALC_VOLUME_SLEW_TIME_IC_1_MASK        0xC0
#define R12_ALC_VOLUME_SLEW_TIME_IC_1_SHIFT       6

/* ALC Control 1 (IC 1) */
#define R13_ALC_TARGET_IC_1                       0x0    /* 0000b	[3:0] */
#define R13_ALC_COMPRESSOR_HOLD_TIME_IC_1         0x0    /* 0000b	[7:4] */
#define R13_ALC_TARGET_IC_1_MASK                  0xF
#define R13_ALC_TARGET_IC_1_SHIFT                 0
#define R13_ALC_COMPRESSOR_HOLD_TIME_IC_1_MASK    0xF0
#define R13_ALC_COMPRESSOR_HOLD_TIME_IC_1_SHIFT   4

/* ALC Control 2 (IC 1) */
#define R14_ALC_DECAY_TIME_IC_1                   0x0    /* 0000b	[3:0] */
#define R14_ALC_COMPRESSOR_ATTACK_TIME_IC_1       0x0    /* 0000b	[7:4] */
#define R14_ALC_DECAY_TIME_IC_1_MASK              0xF
#define R14_ALC_DECAY_TIME_IC_1_SHIFT             0
#define R14_ALC_COMPRESSOR_ATTACK_TIME_IC_1_MASK  0xF0
#define R14_ALC_COMPRESSOR_ATTACK_TIME_IC_1_SHIFT 4

/* ALC Control 3 (IC 1) */
#define R15_NOISE_GATE_THRESHOLD_IC_1             0x0    /* 00000b	[4:0] */
#define R15_NOISE_GATE_FUNCTION_IC_1              0x0    /* 0b	[5] */
#define R15_NOISE_GATE_TYPE_IC_1                  0x0    /* 00b	[7:6] */
#define R15_NOISE_GATE_THRESHOLD_IC_1_MASK        0x1F
#define R15_NOISE_GATE_THRESHOLD_IC_1_SHIFT       0
#define R15_NOISE_GATE_FUNCTION_IC_1_MASK         0x20
#define R15_NOISE_GATE_FUNCTION_IC_1_SHIFT        5
#define R15_NOISE_GATE_TYPE_IC_1_MASK             0xC0
#define R15_NOISE_GATE_TYPE_IC_1_SHIFT            6

/* Serial Port Control 0 (IC 1) */
#define R16_SP_CTRL0_SDBUSMSTRMD_IC_1             0x0    /* 0b	[0] */
#define R16_SP_CTRL0_CHANFRM_IC_1                 0x0    /* 00b	[2:1] */
#define R16_SP_CTRL0_LRCLK_POL_IC_1               0x0    /* 0b	[3] */
#define R16_SP_CTRL0_BCLK_IC_1                    0x0    /* 0b	[4] */
#define R16_SP_CTRL0_LRCLK_IC_1                   0x0    /* 0b	[5] */
#define R16_DITHER_ENABLE_IC_1                    0x0    /* 0b	[7] */
#define R16_SP_CTRL0_SDBUSMSTRMD_IC_1_MASK        0x1
#define R16_SP_CTRL0_SDBUSMSTRMD_IC_1_SHIFT       0
#define R16_SP_CTRL0_CHANFRM_IC_1_MASK            0x6
#define R16_SP_CTRL0_CHANFRM_IC_1_SHIFT           1
#define R16_SP_CTRL0_LRCLK_POL_IC_1_MASK          0x8
#define R16_SP_CTRL0_LRCLK_POL_IC_1_SHIFT         3
#define R16_SP_CTRL0_BCLK_IC_1_MASK               0x10
#define R16_SP_CTRL0_BCLK_IC_1_SHIFT              4
#define R16_SP_CTRL0_LRCLK_IC_1_MASK              0x20
#define R16_SP_CTRL0_LRCLK_IC_1_SHIFT             5
#define R16_DITHER_ENABLE_IC_1_MASK               0x80
#define R16_DITHER_ENABLE_IC_1_SHIFT              7

/* Serail Port Control 1 (IC 1) */
#define R17_DATA_DELAY_FROM_LRCLK_IC_1            0x0    /* 00b	[1:0] */
#define R17_SP_CTRL1_MSB_POSITION_IC_1            0x0    /* 0b	[2] */
#define R17_SP_CTRL1_DAC_CHAN_POSITION_IC_1       0x0    /* 0b	[3] */
#define R17_SP_CTRL1_ADC_CHAN_POSITION_IC_1       0x0    /* 0b	[4] */
#define R17_SP_CTRL1_NUMBER_OF_BIT_CLK_CYCLES_IC_1 0x0   /* 000b	[7:5] */
#define R17_DATA_DELAY_FROM_LRCLK_IC_1_MASK       0x3
#define R17_DATA_DELAY_FROM_LRCLK_IC_1_SHIFT      0
#define R17_SP_CTRL1_MSB_POSITION_IC_1_MASK       0x4
#define R17_SP_CTRL1_MSB_POSITION_IC_1_SHIFT      2
#define R17_SP_CTRL1_DAC_CHAN_POSITION_IC_1_MASK  0x8
#define R17_SP_CTRL1_DAC_CHAN_POSITION_IC_1_SHIFT 3
#define R17_SP_CTRL1_ADC_CHAN_POSITION_IC_1_MASK  0x10
#define R17_SP_CTRL1_ADC_CHAN_POSITION_IC_1_SHIFT 4
#define R17_SP_CTRL1_NUMBER_OF_BIT_CLK_CYCLES_IC_1_MASK 0xE0
#define R17_SP_CTRL1_NUMBER_OF_BIT_CLK_CYCLES_IC_1_SHIFT 5

/* Converter Ctrl 0 (IC 1) */
#define R18_CONV_CTRL0_SAMPLE_RATE_IC_1           0x0    /* 000b	[2:0] */
#define R18_ADC_OVERSAMPLING_IC_1                 0x0    /* 0b	[3] */
#define R18_DAC_OVERSAMPLING_IC_1                 0x0    /* 0b	[4] */
#define R18_ON_CHIP_DAC_IC_1                      0x0    /* 00b	[6:5] */
#define R18_CONV_CTRL0_SAMPLE_RATE_IC_1_MASK      0x7
#define R18_CONV_CTRL0_SAMPLE_RATE_IC_1_SHIFT     0
#define R18_ADC_OVERSAMPLING_IC_1_MASK            0x8
#define R18_ADC_OVERSAMPLING_IC_1_SHIFT           3
#define R18_DAC_OVERSAMPLING_IC_1_MASK            0x10
#define R18_DAC_OVERSAMPLING_IC_1_SHIFT           4
#define R18_ON_CHIP_DAC_IC_1_MASK                 0x60
#define R18_ON_CHIP_DAC_IC_1_SHIFT                5

